[
  {
    "Title": "Trucking Industry",
    "Description": "Orchestrated the deployment and technical support of cloud-native telematics solutions for the trucking industry, managing SaaS provisioning, secure network integration (including VPNs), API implementation (web and mobile), and SQL database integration to ensure seamless, scalable service delivery.",
    "IndustryImg": "TruckingImg"
  },
  {
    "Title": "Freight Rail",
    "Description": "Led the modernization of legacy telematics products for the freight rail industry, transitioning from satellite communication using Ku-band to a scalable hybrid architecture. This new architecture combined ground-based infrastructure (LTE-M as the primary channel) with satellite communication, resulting in reduced operational costs and enhanced system performance.",
    "IndustryImg": "RailImg"
  },
  {
    "Title": "Heavy Equipment (Construction Machinery)",
    "Description": "Led the deployment of telematics products for the heavy equipment industry, providing real-time monitoring and telemetry solutions for construction machinery.",
    "IndustryImg": "ConstructionMachineryImg"
  },
  {
    "Title": "Automotive Industry (OEM & Aftermarket)",
    "Description": "Collaborated with cross-functional teams to deploy OEM telematics products for the automotive industry, enabling enhanced truck connectivity, real-time diagnostics and remote monitoring.",
    "IndustryImg": "AutomotiveImg"
  },
  {
    "Title": "Electric Utility (Distribution)",
    "Description": "Collaborated with engineering leaders to design a comprehensive location, communication, and dispatch system for the energy sector. This solution integrated vehicle-embedded hardware (mobile communication and location terminal interfacing with an Android device), hybrid communication services (cellular and satellite), and a Software as a Service (SaaS) platform, enhancing operational efficiency for electricity distribution companies by optimizing field team coordination.",
    "IndustryImg": "UtilityImg"
  }
]
